#+TITLE:     Org Bash Utils
#+AUTHOR:    Osiris Alejandro Gómez
#+EMAIL:     osiux@osiux.com
#+LANGUAGE:  en
#+LINK:      ISSUE https://github.com/osiris/org-bash-utils/issues/
#+LINK:      GIT https://github.com/osiris/org-bash-utils/commit/



** Releases
*** Release 0.1 [2/2]
**** DONE publish actual version of scripts
     CLOSED: [2014-03-11 mar 10:56] SCHEDULED: <2014-03-11 mar>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2014-03-11 mar 10:56]
     CLOCK: [2014-03-11 mar 10:30]--[2014-03-11 mar 10:55] =>  0:25
     :END:

**** DONE add =org-year=
     CLOSED: [2014-03-11 mar 12:46]
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2014-03-11 mar 12:46]
     CLOCK: [2014-03-11 mar 12:10]--[2014-03-11 mar 12:45] =>  0:35
     :END:

     - Like =org-clock= but show complete year

**** add examples [2/2]
***** DONE =org-timeline= full year
      CLOSED: [2014-03-11 mar 12:57]
      :LOGBOOK:
      - State "DONE"       from "NEXT"       [2014-03-11 mar 12:57]
      :END:

***** DONE =org-status=
      CLOSED: [2014-03-11 mar 13:01]
      :LOGBOOK:
      - State "DONE"       from "NEXT"       [2014-03-11 mar 13:01]
      CLOCK: [2014-03-11 mar 12:45]--[2014-03-11 mar 12:57] =>  0:12
      :END:

*** TODO Release 0.2

** Bugs [2/2]
*** NEXT =BAR= is empty when second timestamp is greater than first timestamp
*** NEXT [[ISSUE:1]] Work in the current directory
    :LOGBOOK:
    CLOCK: [2014-03-29 sáb 10:17]--[2014-03-29 sáb 10:59] =>  0:42
    :END:

    - [ ] replace harcode dir =~/org= for =$ORG_DIR= variable
    - [X] set default directory current directory using =$PWD= variable
    - [-] add =-dir= variable for run in specific directory
      - [X] next
      - [X] todo
      - [X] someday
      - [ ] done
      - [ ] org-clock
      - [ ] org-log
      - [ ] org-plot
      - [ ] org-status
      - [ ] org-year
      - [ ] org-timeline

*** DONE [[ISSUE:2]] How to use your commands from anywhere?
    CLOSED: [2014-03-12 mié 15:08]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2014-03-12 mié 15:08]
    CLOCK: [2014-03-12 mié 14:58]--[2014-03-12 mié 15:05] =>  0:07
    :END:

    - [X] add a *setup* section in =README.org=

*** DONE don't export ICS files in =agenda-ascii= without =-i= parameter
    CLOSED: [2014-07-17 jue 09:48]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2014-07-17 jue 09:48]
    CLOCK: [2014-07-17 jue 09:13]--[2014-07-17 jue 09:44] =>  0:31
    :END:

    - [X] set default value for =$ORG_FILES= variable, setting files
      with current =$YEAR-$MONTH= scheduled date.

*** NEXT repair =org-plot= [4/10] [40%]
    :LOGBOOK:
    CLOCK: [2014-09-12 vie 15:29]--[2014-09-12 vie 17:59] =>  2:30
    CLOCK: [2014-09-15 lun 19:16]--[2014-09-15 lun 21:25] =>  2:09
    CLOCK: [2014-09-16 mar 01:00]--[2014-09-16 mar 02:21] =>  1:24
    :END:

    * [X] set dynamic xrange
    * [X] fix TABs separator column
    * [X] add basic parameters
    * [X] generate DAT/PLT/PNG files
    * [ ] set options by graph type (year|month|week)
    * [ ] add parameter date by regexp pattern
    * [ ] set dynamic yrange
    * [ ] set same colors for each .org file
    * [ ] add parameter for graph size
    * [ ] add examples

** Features [2/2]
*** NEXT don't show empty hours columns
*** NEXT add proyect filter to =org-clock= and =org-year=
*** NEXT verify negative results in =org-timeline=
*** DONE add second parameter for grep filename =org-clock=
    CLOSED: [2014-03-18 mar 08:55]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2014-03-18 mar 08:55]
    CLOCK: [2014-03-18 mar 08:46]--[2014-03-18 mar 08:54] =>  0:08
    :END:

*** NEXT drafts =org-habits= 
    :LOGBOOK:
    CLOCK: [2014-03-18 mar 09:07]--[2014-03-18 mar 09:32] =>  0:25
    :END:

    | 01 | 02 | 03 | 04 | 05 | 06 | 07 | 08 | 09 | 10 | 11 | 12 | 13 | 14 | 15 | 16 |  17 | 18 | 19 | 20 | 21 | 22 | 23 | 24 | 25 | 26 | 27 | 28 |
    |----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+-----+----+----+----+----+----+----+----+----+----+----+----|
    |  □ |  □ |  □ |  ▣ |  □ |  ▣ |  ▣ |  □ |  □ |  ▣ |  □ |  □ |  ▣ |  ▣ |  □ |  □ |   ▣ |  ▣ |  □ |  □ |  □ |  □ |  □ |  ▣ |  ▣ |  □ |  □ |  ▣ |
    |----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+-----+----+----+----+----+----+----+----+----+----+----+----|
    |    |    |    | 38 |    | 40 | 66 |    |    | 48 |    |    | 53 | 60 |    |    | 180 | 84 |    |    |    |    |    | 49 | 60 |    |    | 31 |

*** DONE =org-scheduled=
    CLOSED: [2014-07-17 jue 09:54]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2014-07-17 jue 09:54]
    :END:

    - find files with current =$YEAR-$MONTH= scheduled date like
      =agenda-ascii=

** Merge [1/1]
*** DONE [[GIT:29a95f75]] Merge pull request #4 from sente/master
    CLOSED: [2014-09-12 vie 17:56]
    :LOGBOOK:
    - State "DONE"       from ""           [2014-09-12 vie 17:56]
    CLOCK: [2014-09-12 vie 15:25]--[2014-09-12 vie 15:29] =>  0:04
    :END:

** README
*** DONE add example of =org-clock= for second parameter
    CLOSED: [2014-03-18 mar 09:06]
    :LOGBOOK:
    - State "DONE"       from ""           [2014-03-18 mar 09:06]
    CLOCK: [2014-03-18 mar 09:00]--[2014-03-18 mar 09:06] =>  0:06
    :END:

*** DONE add example of =barra= for =bash history= statistics
    CLOSED: [2014-04-15 mar 09:42]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2014-04-15 mar 09:42]
    CLOCK: [2014-04-15 mar 09:01]--[2014-04-15 mar 09:42] =>  0:41
    :END:

    - [X] =bash -i= not working anymore, report the bug
